Revit 2026 API

# RebarShapeDrivenAccessorMultiplanarDepth Property

---

For a multiplanar rebar, the depth of the instance.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double MultiplanarDepth { get; set; }
```
```vb
Public Property MultiplanarDepth As Double
	Get
	Set
```
```cpp
public:
property double MultiplanarDepth {
	double get ();
	void set (double value);
}
```
```fsharp
member MultiplanarDepth : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: multiplanarDepth must be positive. |
| InvalidOperationException | This RebarShapeDrivenAccessor is not an instance of a multiplanar shape. -or- This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

Applicable only when an instance of a RebarShape with a RebarShapeMultiplanarDefinition.

#### Reference

RebarShapeDrivenAccessor Class

Autodesk.Revit.DB.Structure Namespace